In [1]:
#**************PART 7***********

In [2]:
import pandas as pd

In [7]:
df=pd.read_csv("Fortune_10.csv",skiprows=1)
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [8]:
#head is for fetching first 5 rows
df.head()

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%

In [5]:
#for printing any number of rows from starting

In [9]:
df.head(1)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%

In [10]:
#tail is for fetching last 5 rows

In [11]:
#default value 5

In [12]:
df.tail()

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [13]:
df.tail(2)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [14]:
df.tail(7)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
3,4,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [15]:
#to change datatype of any column
df=pd.read_csv("Fortune_10.csv",skiprows=1,dtype={'ID':'float64'})
df

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2.0,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3.0,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4.0,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5.0,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6.0,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7.0,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8.0,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9.0,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10.0,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [16]:
#u can change datatype of multiple columns as well by using comma

In [25]:
df=pd.read_csv("Fortune_10.csv",dtype={'ID':'float','Profit':'float64'})
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1.0,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553.0,30%
1,2.0,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916.0,20%
2,3.0,Yes,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820.0,7%
3,4.0,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557.0,26%
4,5.0,Yes,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627.0,8%
5,6.0,Yes,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816.0,23%
6,7.0,Yes,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116.0,6%
7,8.0,Yes,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830.0,4%
8,9.0,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180.0,18%
9,10.0,Yes,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060.0,7%

In [23]:
#If u wanna print True in place of Yes

In [26]:
df=pd.read_csv("Fortune_10.csv",true_values=['Yes'])
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,True,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,True,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,True,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,True,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,True,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6,True,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,True,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,True,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,True,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,True,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [28]:
#if u wanna print False in place of unnecessary value

In [29]:
#for that we are using false_values

In [30]:
df=pd.read_csv("Fortune_10.csv",false_values=['No'],true_values=['Yes'])
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,True,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,True,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,True,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,True,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,True,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%
5,6,True,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,True,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,True,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,True,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,True,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

#**************************PART 8*****************************

In [3]:
import pandas as pd

In [6]:
df=pd.read_csv("Fortune_10.csv")
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NaN
4,5,No,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627,NaN
5,6,Yes,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816,NaN
6,7,Yes,Cityace,NaN,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,NaN,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [8]:
#in the place of missing value it is printing NaN
#it's pandas feature to consider it as NaN

In [10]:
#It is considering the different string as NaN as well like===

In [11]:
#N/A , -NaN  , null  ,#N/A N/A  , -nan  ,n/a  , #NA    , N/A  , nan , -1.#IND , NA, 1.#IND , -1.#QNAN , NULL,1.#QNAN

In [12]:
#it is interpreting all above value as NAN

In [13]:
# Except all above if u have any other values unusable u can consider it as NaN as well

In [14]:
df=pd.read_csv("Fortune_10.csv")
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NaN
4,5,No,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627,NaN
5,6,Yes,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816,NaN
6,7,Yes,Cityace,not available,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,NaN,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [17]:
#u can convert not available to NaN as well see below

In [16]:
df=pd.read_csv("Fortune_10.csv",na_values=['not available'])
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NaN
4,5,No,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627,NaN
5,6,Yes,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816,NaN
6,7,Yes,Cityace,NaN,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,NaN,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [18]:
# u can convert multiple values to NaN by taking it into list

In [3]:
import pandas as pd
df=pd.read_csv("Fortune_10.csv")
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NaN
4,5,No,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627,nnp
5,6,Yes,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816,NaN
6,7,Yes,Cityace,not available,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,NaN,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [20]:
#u can see nnp in 4 th row and not available in 6 th row

In [1]:
#Lets convert it into NaN

In [4]:
df=pd.read_csv("Fortune_10.csv",na_values=['not available','nnp'])
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NaN
4,5,No,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627,NaN
5,6,Yes,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816,NaN
6,7,Yes,Cityace,NaN,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,NaN,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [5]:
#so in this way u can consider multiple elements as NaN ,By using list

In [6]:
#if u wanna consider specific column , row as a NaN THEN

In [7]:
df=pd.read_csv("Fortune_10.csv")
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NaN
4,5,No,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627,nnp
5,6,Yes,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816,NaN
6,7,Yes,Cityace,not available,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,NaN,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [8]:
#NOW will only change not available into NaN 
# IT can be done using dictionary
#Let's do it for 6 th row industry column

In [9]:
df=pd.read_csv("Fortune_10.csv",na_values={'Industry':'not available'})
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NaN
4,5,No,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627,nnp
5,6,Yes,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816,NaN
6,7,Yes,Cityace,NaN,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,NaN,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [11]:
#nnp is at is is  (let's do it for it as well)

In [12]:
df=pd.read_csv("Fortune_10.csv",na_values={'Industry':'not available','Growth':'nnp'})
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NaN
4,5,No,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627,NaN
5,6,Yes,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816,NaN
6,7,Yes,Cityace,NaN,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,NaN,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [13]:
#The strings which we mentioned above to whom panda directly consider NaN 
#U don't wanna make it default NaN

In [14]:
df=pd.read_csv("Fortune_10.csv",)
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NaN
4,5,No,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627,nnp
5,6,Yes,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816,NaN
6,7,Yes,Cityace,NaN,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,NaN,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [15]:
#By default it is considering NULL, #N/A as NaN Values

In [16]:
df=pd.read_csv("Fortune_10.csv",keep_default_na=False)
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,NULL
4,5,No,Techdrill,#N/A,2009,"$10,573,990","7,435,363 Dollars",3138627,nnp
5,6,Yes,Techline,#N/A,2006,"$13,898,119","5,470,303 Dollars",8427816,
6,7,Yes,Cityace,,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [17]:
#U can now see the 3rd ,4th and 5th row

In [19]:
#if u are sure that there is no missing value or useless value we can FILTER it
#it can make parsing easy(syntax analysis )the process of analysing the string of symbols

In [20]:
####Na_filter (for finding missing value)

In [22]:
df=pd.read_csv("Fortune_10.csv",na_filter=False)
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,7%
4,5,No,Techdrill,IT Services,2009,"$10,573,990","7,435,363 Dollars",3138627,7%
5,6,Yes,Techline,IT Services,2006,"$13,898,119","5,470,303 Dollars",8427816,7%
6,7,Yes,Cityace,IT Services,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,IT Services,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [30]:
#*************************Part 9************************
#Handling missing value #2

In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("Fortune_10.csv")
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,7%
4,5,No,Techdrill,IT Services,2009,"$10,573,990","7,435,363 Dollars",3138627,7%
5,6,Yes,Techline,IT Services,2006,"$13,898,119","5,470,303 Dollars",8427816,7%
6,7,Yes,Cityace,IT Services,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,IT Services,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [6]:
#checking null value in dataset
df.isnull()

      ID   Date   Name  Industry  Inception  Revenue  Expenses  Profit  Growth
0  False  False  False     False      False    False     False   False   False
1  False  False  False     False      False    False     False   False   False
2  False  False  False     False      False    False     False   False   False
3  False  False  False     False      False    False     False   False   False
4  False  False  False     False      False    False     False   False   False
5  False  False  False     False      False    False     False   False   False
6  False  False  False     False      False    False     False   False   False
7  False  False  False     False      False    False     False   False   False
8  False  False  False     False      False    False      True   False   False
9  False  False  False     False      False    False     False   False   False

In [7]:
#let's go towards dataset and delete some value then check isnull()

In [9]:
df=pd.read_csv("Fortune_10.csv")
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,7%
4,5,No,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627,NaN
5,6,Yes,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816,NaN
6,7,Yes,Cityace,NaN,2010,"$9,254,614","6,249,498 Dollars",3005116,NaN
7,8,No,Kayelectronics,IT Services,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [11]:
df.isnull()#if it's true  i.e.null then returns True

      ID   Date   Name  Industry  Inception  Revenue  Expenses  Profit  Growth
0  False  False  False     False      False    False     False   False   False
1  False  False  False     False      False    False     False   False   False
2  False  False  False     False      False    False     False   False   False
3  False  False  False     False      False    False     False   False   False
4  False  False  False      True      False    False     False   False    True
5  False  False  False      True      False    False     False   False    True
6  False  False  False      True      False    False     False   False    True
7  False  False  False     False      False    False     False   False   False
8  False  False  False     False      False    False      True   False   False
9  False  False  False     False      False    False     False   False   False

In [12]:
#checking how many numbers of null values in column

In [13]:
df.isnull().sum()

ID           0
Date         0
Name         0
Industry     3
Inception    0
Revenue      0
Expenses     1
Profit       0
Growth       3
dtype: int64

In [14]:
#wanna know total null values

In [15]:
df.isnull().sum().sum()

7

In [16]:
#notnull is opposite to isnull
df=pd.read_csv("Fortune_10.csv")
df

,ID,Date,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Services,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Services,2013,"$14,026,934","7,429,377 Dollars",6597557,7%
4,5,No,Techdrill,NaN,2009,"$10,573,990","7,435,363 Dollars",3138627,NaN
5,6,Yes,Techline,NaN,2006,"$13,898,119","5,470,303 Dollars",8427816,NaN
6,7,Yes,Cityace,NaN,2010,"$9,254,614","6,249,498 Dollars",3005116,NaN
7,8,No,Kayelectronics,IT Services,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Services,2011,"$14,001,180",NaN,11901180,18%
9,10,No,Trantraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [17]:
df.notnull()

     ID  Date  Name  Industry  Inception  Revenue  Expenses  Profit  Growth
0  True  True  True      True       True     True      True    True    True
1  True  True  True      True       True     True      True    True    True
2  True  True  True      True       True     True      True    True    True
3  True  True  True      True       True     True      True    True    True
4  True  True  True     False       True     True      True    True   False
5  True  True  True     False       True     True      True    True   False
6  True  True  True     False       True     True      True    True   False
7  True  True  True      True       True     True      True    True    True
8  True  True  True      True       True     True     False    True    True
9  True  True  True      True       True     True      True    True    True

In [18]:
#Its consider the values present

In [20]:
df.notnull().sum()#returns no of values present

ID           10
Date         10
Name         10
Industry      7
Inception    10
Revenue      10
Expenses      9
Profit       10
Growth        7
dtype: int64

In [22]:
df.notnull().sum().sum()#the no of values which are present

83

In [23]:
#let's see it for series

In [26]:
#Series
import numpy as np
sr=pd.Series([1,2,3,np.nan,4,np.nan])
sr

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    NaN
dtype: float64

In [27]:
sr.isnull()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [28]:
sr.isnull().sum()

2

In [29]:
sr.isnull().sum().sum()

2

In [31]:
#**********************PART 10********************************
#Handling missing value #3

In [32]:
df=pd.read_csv("Fortune_5.csv")
df

   ID             Name           Companies        Profit    Growth Unnamed: 5
0   1          Lamtone         IT Services  $11,757,018    5274553        30%
1   2        Stripfind  Financial Services  $12,329,371   11412916        20%
2   3  Canecorporation              Health  $10,597,009    3005820         7%
3   4              NaN         IT Services  $14,026,934    6597557         7%
4   5              NaN                 NaN  $10,573,990    3138627        NaN

In [33]:
#drpna is used for dropping the corresponding row/column which contains missing values and creating new dataframe

In [36]:
df.dropna()#dropped 3rd and 4 th row by default

   ID             Name           Companies        Profit    Growth Unnamed: 5
0   1          Lamtone         IT Services  $11,757,018    5274553        30%
1   2        Stripfind  Financial Services  $12,329,371   11412916        20%
2   3  Canecorporation              Health  $10,597,009    3005820         7%

In [38]:
df.dropna(axis=1)#dropping the column which contains NaN values

   ID        Profit    Growth
0   1  $11,757,018    5274553
1   2  $12,329,371   11412916
2   3  $10,597,009    3005820
3   4  $14,026,934    6597557
4   5  $10,573,990    3138627

In [39]:
#lets's understand dropna's different parameters

In [40]:
#df.dropna(
#    axis: 'Axis' = 0,
#    how: 'str' = 'any',
#    thresh=None,
 #   subset: 'IndexLabel' = None,
  #  inplace: 'bool' = False,)

In [43]:
#HOW = if any value is NaN then its drop that row or col or 'all' means it drops all rows and col

In [42]:
df.dropna(how='any')

   ID             Name           Companies        Profit    Growth Unnamed: 5
0   1          Lamtone         IT Services  $11,757,018    5274553        30%
1   2        Stripfind  Financial Services  $12,329,371   11412916        20%
2   3  Canecorporation              Health  $10,597,009    3005820         7%

In [45]:
df=pd.read_csv("Fortune_5.csv")
df

   ID             Name           Companies    Profit Growth
0   1          Lamtone         IT Services   5274553    30%
1   2        Stripfind  Financial Services  11412916    20%
2   3  Canecorporation              Health   3005820     7%
3   4              NaN         IT Services   6597557     7%
4   5              NaN                 NaN   3138627    NaN

In [48]:
df.dropna(how='any', axis=1)

   ID    Profit
0   1   5274553
1   2  11412916
2   3   3005820
3   4   6597557
4   5   3138627

In [49]:
df.dropna(how='any')

   ID             Name           Companies    Profit Growth
0   1          Lamtone         IT Services   5274553    30%
1   2        Stripfind  Financial Services  11412916    20%
2   3  Canecorporation              Health   3005820     7%

In [51]:
df.dropna(how='all')#it looks like same df 
#it works only when having all values nan in row / col

   ID             Name           Companies    Profit Growth
0   1          Lamtone         IT Services   5274553    30%
1   2        Stripfind  Financial Services  11412916    20%
2   3  Canecorporation              Health   3005820     7%
3   4              NaN         IT Services   6597557     7%
4   5              NaN                 NaN   3138627    NaN

In [52]:
#so let's make changes and then see

In [53]:
df.dropna(how='all')

   ID             Name           Companies    Profit Growth
0   1          Lamtone         IT Services   5274553    30%
1   2        Stripfind  Financial Services  11412916    20%
2   3  Canecorporation              Health   3005820     7%
3   4              NaN         IT Services   6597557     7%
4   5              NaN                 NaN   3138627    NaN

In [56]:
#'THRESH' parameter is used when we want minimum not null values
#it's printing the row which are having at least one  not null value i.e. only printing minimum not  null values

In [57]:
df.dropna(thresh=1)

   ID             Name           Companies    Profit Growth
0   1          Lamtone         IT Services   5274553    30%
1   2        Stripfind  Financial Services  11412916    20%
2   3  Canecorporation              Health   3005820     7%
3   4              NaN         IT Services   6597557     7%
4   5              NaN                 NaN   3138627    NaN

In [58]:
df.dropna(thresh=1)

   ID             Name           Companies    Profit Growth
0   1          Lamtone         IT Services   5274553    30%
1   2        Stripfind  Financial Services  11412916    20%
2   3  Canecorporation              Health   3005820     7%
3   4              NaN         IT Services   6597557     7%
4   5              NaN                 NaN   3138627    NaN

In [59]:
df=pd.read_csv("Fortune_5.csv")
df

   ID             Name           Companies  Profit Growth
0   1          Lamtone         IT Services     NaN    30%
1   2        Stripfind  Financial Services     NaN    20%
2   3  Canecorporation              Health     NaN     7%
3   4              NaN         IT Services     NaN     7%

In [62]:
df.dropna(thresh=1,axis=1)#u can see profit column is deleted

   ID             Name           Companies Growth
0   1          Lamtone         IT Services    30%
1   2        Stripfind  Financial Services    20%
2   3  Canecorporation              Health     7%
3   4              NaN         IT Services     7%

In [63]:
#how many not null values u want u can specify in thersh if its 1 checking for at least one not null value and printing the same

In [65]:
df.dropna(thresh=4)#4 th row not considered

   ID             Name           Companies  Profit Growth
0   1          Lamtone         IT Services     NaN    30%
1   2        Stripfind  Financial Services     NaN    20%
2   3  Canecorporation              Health     NaN     7%

In [66]:
#subset is checking the column and skipping the null values rows and printing all other rows

In [68]:
df=pd.read_csv("Fortune_5.csv")
df

   ID             Name           Companies  Profit Growth
0   1          Lamtone         IT Services     NaN    30%
1   2        Stripfind  Financial Services     NaN    20%
2   3  Canecorporation              Health     NaN     7%
3   4              NaN         IT Services     NaN     7%

In [69]:
df.dropna(subset=['Name'])#in name col 4 th row skipped

   ID             Name           Companies  Profit Growth
0   1          Lamtone         IT Services     NaN    30%
1   2        Stripfind  Financial Services     NaN    20%
2   3  Canecorporation              Health     NaN     7%

In [70]:
#next parameter inplace it is not creating new dataframe only updating previous one so we need to call it

In [72]:
df.dropna(inplace=True)#in this so all rows having nan values so it is showing non
df

Empty DataFrame
Columns: [ID, Name, Companies, Profit, Growth]
Index: []